# ------------------------------
# Lessons 05
# __autor__ - Турчин Богдан П.
# -------------------------------
import os
print("*------------------------------*")
print("*  Четвертое домашнее задание  *")
print("*        hw05_easy.py          *")
print("*           Задача 1           *")
print("*------------------------------*")

# Задача-1:
# Напишите скрипт, создающий директории dir_1 - dir_9 в папке,
# из которой запущен данный скрипт.
# И второй скрипт, удаляющий эти папки.

# ------------------------------------------------------------------
print('Создание директорий!  less_1 - less_9')
print('------------------------------------------------------------------')

# Получаем текущую директорию
path = os.getcwd()
print('Текущая директороия %s' % path)
print('-----------------------------------------------------------')
path = ''
for i in range(1, 10):
    path = "less_" + str(i)
    try:
        os.makedirs(path)
    except OSError:
        print('Создать директорию %s не удалось' % path)
    else:
        print('Успешно создана директория %s ' % path)

print('-----------------------------------------------------------------')
path = os.getcwd()
print('Но текущая директороия \n %s' % path)
print('-----------------------------------------------------------------')
Y = input('Хотите удалить созданные директории Y/N ')

if Y == 'Y' or Y == 'y':
    for i in range(1, 10):
        path = "less_" + str(i)
        try:
            os.rmdir(path)
        except OSError:
            print('Удалить директорию %s не удалось' % path)
        else:
            print('Успешно удалена директория %s' % path)
print()
print("*------------------------------*")
print("*  Четвертое домашнее задание  *")
print("*        hw05_easy.py          *")
print("*           Задача 2           *")
print("*------------------------------*")

# Задача-2:
# Напишите скрипт, отображающий папки текущей директории.
print('------------------------------------------------------------------')
print('Папки в текущей директории!')
print('------------------------------------------------------------------')
list = os.listdir()
for i in list:
    print(i)

print('------------------------------------------------------------------')
print('Другой вариант!')
print('------------------------------------------------------------------')
for _ in os.listdir(os.getcwd()):
    print(_)

print()
print("*------------------------------*")
print("*  Четвертое домашнее задание  *")
print("*        hw05_easy.py          *")
print("*           Задача 3           *")
print("*------------------------------*")
import shutil
# Задача-3:
print('Написать скрипт, создающий копию файла, из которого запущен данный скрипт.')

name_file = os.path.realpath(__file__)
new_file = name_file +'.copy'

if not os.path.isfile(new_file):
    shutil.copy(name_file, new_file)
    print(new_file + ' - создан успешно!')
else:
    print('Файл уже скопирован')