# ------------------------------
# Lessons 01
# __autor__ - Турчин Богдан П.
#-------------------------------
print("*---------------------------*")
print("*  Первое домашнее задание  *")
print("*       hw01_easy.py        *")
print("*-------- Задача 1 ---------*")
print("*---------------------------*")

nam = 256842
print("Задано число:", nam)
str_nam = str(nam)
i = 0
while i < len(str_nam):
    print(str_nam[i])
    i += 1

print("Второй вариант вывода на экран цифр из числа")
namber = input("Для этого введите число: ")
i = 0
print("Вывод цифр циклом while")
while i < len(namber):
    print(namber[i])
    i += 1

print("Вывод цифр циклом for")
for i in namber:
    print(i)

print("*---------------------------*")
print("*  Первое домашнее задание  *")
print("*       hw01_easy.py        *")
print("*-------- Задача 2 ---------*")
print("*---------------------------*")

print("Замена значения переменных местами!")

a = input('Введите первое число a = ')
b = input('Введите второе число b = ')

print("Начальное значение переменных a и b >")
print("a = ", a, ";" " b = ", b)
c = a
a = b
b = c
print("Конечное значение переменных a и b >")
print("a = ", a, ";" " b = ", b)

print("*---------------------------*")
print("*  Первое домашнее задание  *")
print("*       hw01_easy.py        *")
print("*-------- Задача 3 ---------*")
print("*---------------------------*")

age = int(input("Введите свой возраст: "))

if age >= 18:
    print("Доступ разрешен")
else:
    print("Извините, пользование данным ресурсом только с 18 лет!")