# ------------------------------
# Lessons 04
# __autor__ - Турчин Богдан П.
#-------------------------------
import random
print("*------------------------------*")
print("*  Четвертое домашнее задание  *")
print("*        hw04_easy.py          *")
print("*           Задача 1           *")
print("*------------------------------*")

# Задание-1:
# Дан список, заполненный произвольными целыми числами.
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [1, 2, 4, 0] --> [1, 4, 16, 0]
# -----------------------------------------------------
list_var = [x for x in range(10)]
list_num = [x ** 2 for x in range(20) if x % 2 == 0]
list_run = [random.randint(-10, 10) for _ in range(10)]
list_new = []
list_new_run = []

print(list_run, '- список случайных чисел')
# Первый способ записи
for i in range(len(list_run)):
    list_new_run.append(list_run[i] ** 2)
print(list_new_run, '- квадраты случайного списка.')
print('------------------------------------------------------------------')
print(list_var, '- первый исходный список.')

# Первый способ записи
for i in range(len(list_var)):
    list_new.append(list_var[i] ** 2)

# Второй способ записи
list_new_num = [list_num[i] ** 2 for i in range(len(list_num))]

print(list_new, '- квадраты первого списка.')
print('-------------------------------------------')
print(list_num, '- квадраты второго список.')
print(list_new_num,   '- квадраты квадратов второго списка.')

print()

print("*------------------------------*")
print("*  Четвертое домашнее задание  *")
print("*        hw04_easy.py          *")
print("*           Задача 2           *")
print("*------------------------------*")

# Задание-2:
# Даны два списка фруктов.
# Получить список фруктов, присутствующих в обоих исходных списках.
fruits1 = ['Яблоки', 'Груши', 'Сливы', 'Абрикосы', 'Черешня', 'Вишня', 'Алыча']
fruits2 = ['Алыча', 'Сливы', 'Манго', 'Киви', 'Яблоки', 'Ананас', 'Груши', 'Вишня']
print('Исходные списки фруктов: ')
print(fruits1)
print(fruits2)
print('----------------------------------------------------------------')
fruits = list(set(fruits1) & set(fruits2))
print(fruits)

a = [3, 5, 1, 6, 10, 4]
b = [1, 4, 8, 9, 10, 0]
c = list(set(a) & set(b))
print(c)

print()

print("*------------------------------*")
print("*  Четвертое домашнее задание  *")
print("*        hw04_easy.py          *")
print("*           Задача 3           *")
print("*------------------------------*")

# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4

source_list = [num for num in range(-20, 50)]
print('Исходный список:')
print(source_list)
print()
list_one = [num for num in source_list if num % 3 == 0]
print('+ Элемент кратен 3:')
print(list_one)
print()
list_two = [num for num in source_list if num > 0]
print('+ Элемент положительный:')
print(list_two)
print()
list_three = [num for num in source_list if num % 4 != 0]
print('+ Элемент не кратен 4:')
print(list_three)
