# Урок 1. Задание № 1
# Найти сумму произведение цифр трехзначного числа,
# которое вводит пользователь.
# ---------------------------------------------------------
# Задание выполнил студент GeekBrains  Турчин Богдан.
# ---------------------------------------------------------
print('Введите три трехзначных числа')
a = int(input('Введите число a = '))
b = int(input('Введите число b = '))
c = int(input('Введите число c = '))

d = a + b + c
g = a * b * c

print("Сумма a + b + c =", d)
print("Произведение a * b * c =", g)