import os


# ----------------------------------------------------------
# Функция перехода в папку
# ----------------------------------------------------------
def change_dir(path):
    if path == '':
        return 'Вы не ввели имя папки!'
    try:
        os.chdir(path)
        return "Успешный переход в папку: {}" .format(path)
    except FileNotFoundError:
        return "Папка dir_{} - не найдена" .format(path)

# ----------------------------------------------------------
# Функция чтения папки
# ----------------------------------------------------------
def list_dir():
    print('-' * 80)
    #if os.listdir(os.getcwd()) != '':
    if os.getcwd() != '':
        for _ in os.listdir(os.getcwd()):
            print(_)
    else:
        print('Папка пустая!')

# ----------------------------------------------------------
# Функция удаления папки
# ----------------------------------------------------------
def remove_dir(name):
	if name == '':
        return 'Вы не ввели имя папки!'
    try:
        os.rmdir(name)
    except OSError:
        print('Удалить директорию %s не удалось' % name)
    else:
        print('Успешно удалена директория %s ' % name)

# ----------------------------------------------------------
# Функция создания папки
# ----------------------------------------------------------
def make_dir(name_dir):
	if name_dir == '':
        return 'Вы не ввели имя папки!'
    try:
        os.makedirs(name_dir)
    except OSError:
        print('Создать директорию %s не удалось' % name_dir)
    else:
        print('Успешно создана директория %s ' % name_dir)